package com.momori.global.util;


import org.springframework.stereotype.Component;

import java.util.Arrays;
import java.util.List;
import java.util.Random;

@Component
public class RandomNameGenerator implements NameGenerator {

    private final List<String> firstWords = Arrays.asList(
        "보람찬", "능통한", "반투명", "담당하는", "우아한", "재빠른", "진실된", "창의적인", "명랑한", "화려한",
        "튼튼한", "유연한", "따뜻한", "거대한", "강력한", "부드러운", "선명한", "신속한", "차분한", "의미있는",
        "차가운", "자랑스러운", "똑똑한", "독특한", "사려깊은", "지혜로운", "성실한", "활기찬", "조용한", "영리한",
        "청순한", "단호한", "친절한", "사랑스러운", "적극적인", "상냥한", "겸손한", "독립적인", "정직한", "감각적인",
        "명확한", "용감한", "자유로운", "강인한", "독창적인", "행복한", "섬세한", "이해심많은", "미묘한", "풍부한",
        "창의적인", "진정한", "헌신적인", "단순한", "우수한", "밝은", "유명한", "확실한", "예리한", "상상력있는",
        "세련된", "유쾌한", "냉정한", "아름다운", "유능한", "깔끔한", "조화로운", "치밀한", "탄력적인", "고요한",
        "우직한", "실용적인", "단단한", "정교한", "고상한", "재미있는", "완벽한", "유머러스한", "신비로운", "기발한",
        "매력적인", "창조적인", "활발한", "정다운", "설득력있는", "독보적인", "품격있는", "논리적인", "기운찬", "친근한",
        "깔끔한", "눈부신", "대담한", "쾌활한", "진지한", "열정적인", "산뜻한", "편안한", "충실한", "예술적인",
        "흐뭇한", "활기찬", "장엄한", "경쾌한", "무한한", "단호한", "호기심많은", "실속있는", "멋진", "심오한",
        "인내심있는", "의욕적인", "고요한", "애정어린", "친절한", "정성어린", "차분한", "화끈한", "사색적인", "청결한",
        "부유한", "재치있는", "절제된", "순수한", "소박한", "흥미로운", "단아한", "섬세한", "성실한", "활동적인",
        "신뢰할만한", "장난기있는", "따스한", "섬세한", "열린", "새로운", "다정한", "창의적인", "정겨운", "끈기있는"
    );

    private final List<String> secondWords = Arrays.asList(
        "백로", "산토끼", "원숭이", "은행나무", "고양이", "강아지", "사자", "호랑이", "독수리", "곰",
        "여우", "다람쥐", "코끼리", "표범", "악어", "고래", "앵무새", "부엉이", "고슴도치", "판다",
        "캥거루", "코알라", "오소리", "돌고래", "수달", "까마귀", "늑대", "너구리", "비둘기", "돼지",
        "소", "양", "닭", "거북이", "참새", "벌", "나비", "매", "독사", "고라니",
        "해마", "두더지", "알파카", "순록", "칠면조", "청설모", "두루미", "사슴", "바다표범", "밍크",
        "원앙", "문어", "갈매기", "토끼", "너구리", "기러기", "도마뱀", "사막여우", "얼룩말", "하마",
        "벌새", "돌고래", "지렁이", "오징어", "가재", "해파리", "고릴라", "수탉", "물소", "청개구리",
        "거미", "산양", "바다사자", "코뿔소", "햄스터", "기린", "악어", "타조", "개미핥기", "살모사",
        "박쥐", "도토리", "낙타", "까치", "수달", "거북이", "오리", "코요테", "펭귄", "청둥오리",
        "구렁이", "담비", "홍학", "사이테스", "칠면조", "붉은여우", "얼룩소", "노루", "여우원숭이", "공작",
        "사막여우", "스컹크", "해달", "살쾡이", "바다코끼리", "프레리독", "재규어", "타란튤라", "카멜레온", "밍크고래",
        "낙지", "쥐", "사마귀", "순록", "까마귀", "도롱뇽", "무당벌레", "나무늘보", "산양", "새우",
        "부채새", "멧돼지", "물개", "산호", "개구리", "투구벌레", "치타", "물방개", "방울뱀", "까치"
    );


    @Override
    public String generateName() {

        Random random = new Random();
        StringBuilder sb = new StringBuilder();
        return sb.append(firstWords.get(random.nextInt(firstWords.size())))
            .append(" ")
            .append(secondWords.get(random.nextInt(secondWords.size())))
            .append(" ")
            .append(Integer.toString(random.nextInt(100) + 1))
            .toString();

    }
}
